Revit 2027 API
SchedulableField.Equality Operator
Determines whether two SchedulableField are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	SchedulableField first,
	SchedulableField second
)
Public Shared Operator = (
	first As SchedulableField,
	second As SchedulableField
) As Boolean
public:
static bool operator ==(
	SchedulableField^ first,
	SchedulableField^ second
)
static let inline (=)
        first : SchedulableField *
        second : SchedulableField  : bool
Parameters
first SchedulableField
The first SchedulableField.
second SchedulableField
The second SchedulableField.
Return Value
Boolean
True if the SchedulableField are the same, otherwise false.
See Also
Reference
SchedulableField Class
Autodesk.Revit.DB Namespace